# ASK_GPT_FOR_RESPONSE_ON_1_ANSWER_FORMAT = r"the user answered the question {} with the answer {} please give a short witty response in hebrew"
# ASK_GPT_FOR_RESPONSE_ON_1_ANSWER_FORMAT = r"המשתמש ענה על השאלה {} עם התשובה {} בבקשה תן תגובה שנונה וקצרה"
import random


AI_BACKGROUND = r"אתה ברמן משועמם, בשביל להכיר את הלקוח שלך אתה שואל אותו סדרה של 10 שאלות, עכשיו  "
USER_Q_AND_A = r"שאלה: {} תשובה: {}\n"
# HOW_TO_RESPOND = r"בבקשה תן תגובה מצחיקה וקצרה, תחליט או להסכים או להיות מופתע מהתשובה"

# nice, but a little long, don't do it too much
FUNNY_RESPOND = r"תגיב בצורה קצרה מצחיקה וקצת מתנשאת"

# here he just tell you a cocktail name
SHORT_RESPOND = r"תגיב ב5 מילים לכל היותר"

# OK
# HOW_TO_RESPOND = r"זאת תשובה מגוחכת, תעליב אותו ותצחק עליו במשפט אחד סך הכל"

# not working at all
# HOW_TO_RESPOND = r"הוא אידיוט מטומטם, תקלל אותו, תגרש אותו מהבר, תענה תשובה בת לכל היותר 10 מילים"

# pretty good
HAPPY_RESPOND = r"תתלהב מאוד! תדבר עם הרבה סימני קריאה, אבל תענה באופן קצר, לכל היותר 8 מילים"

# good
ONE_WORD_RESPOND = r"תענה במילה אחת"

HOW_TO_RESPOND = r"תענה ב3 מילים"

RESPONDS = [FUNNY_RESPOND, SHORT_RESPOND, HAPPY_RESPOND, ONE_WORD_RESPOND]


def get_response_format():
    HOW_TO_RESPOND = random.choice(RESPONDS)
    return AI_BACKGROUND + USER_Q_AND_A + HOW_TO_RESPOND


ASK_GPT_FOR_RESPONSE_ON_1_ANSWER_FORMAT = AI_BACKGROUND + \
    USER_Q_AND_A + HOW_TO_RESPOND


FINAL_PROMPT = """יש יצור בדיוני מצחיק בעל חוש הומור ושנינות מטורפת בסגנון היוצרים של סאותפארק או היוצרים של סיינפלד או הספר של המורמונים וכו' שנקרא לו "הסגנון הרצוי". היצור הזה ממש אוהב בדיחות גרוטסקיות ושנונות והוא ענה לכמה שאלות באופן משעשע במיוחד כדי שמהתשובות תוכל להתאים עבורו קוקטייל מתוך רשימת קוקטיילים נתונה. 
אתה בעל הומור שנון ופרוע ולא מפחד להיות בוטה וישיר מול היצור הבדיוני הזה שממש אוהב את זה ומת על ההומור שלך שהוא ממש בסגנון הרצוי.
להלן רשימת הקוקטיילים לפי הסדר:


ג'ינטוניק פריצת דרך. רכיבים: ["ג'ין", 'טוניק', "לימונצ'לו"]
הטקילה שפגעה בי. רכיבים: ['טקילה', 'ייגרמייסטר', 'מיץ חמוציות', 'קרח']
וודקה בתיק גומי. רכיבים: ['ודקה', 'מיץ תפוזים סחוט', 'דובוני גומי']
רומנטיקה אשכולית. רכיבים: ['רום לבן', 'אשכוליות', 'מי סוכר']
תפוזים ותוססת. רכיבים: ['וודקה', "גזוז בטעם תפוז אדום וצ'ילי"]
קמפארי דרמה. רכיבים: ['קמפארי', 'מיץ תפוזים סחוט', 'קרח']
ג'ין ג'ינג'י. רכיבים: ["ג'ין", "לימונצ'לו", 'מיץ חמוציות', 'קרח']
טקילה בעננים. רכיבים: ['טקילה', 'מיץ חמוציות', 'קשסה', 'קרח']
הטריק של הג'ין. רכיבים: ["ג'ין", 'טקילה', 'טוניק', 'קרח']
רום ותוססת. רכיבים: ['רום לבן', "גזוז בטעם תפוז אדום וצ'ילי", 'קרח']
הפריזאי הסחוט. רכיבים: ["ג'ין", "לימונצ'לו", 'קרח', 'מיץ תפוזים סחוט']
חולם בצ'ילי. רכיבים: ['וודקה', "גזוז בטעם תפוז אדום וצ'ילי", 'קרח']
רומסטר בלילה. רכיבים: ['רום לבן', 'מיץ חמוציות', 'ייגרמייסטר', 'קרח']
דובון הג'ין. רכיבים: ["ג'ין", 'טוניק', 'דובוני גומי', 'קרח']
מרתקילה וקמפארי. רכיבים: ['טקילה', 'קמפארי', 'מיץ תפוזים סחוט', 'קרח']
ריקוד הג'ינג'י. רכיבים: ["ג'ין", "גזוז בטעם תפוז אדום וצ'ילי", 'קרח', 'מי סוכר']
הקסם של הקשסה. רכיבים: ['קשסה', 'אשכוליות', 'קרח', 'מי סוכר']
וודקה לימונצ'לו. רכיבים: ['וודקה', "לימונצ'לו", 'קרח']
מתוק כמו דובון. רכיבים: ['וודקה', 'טוניק', 'דובוני גומי', 'קרח']
הבליק של ג'ימי. רכיבים: ['בורבון', 'טוניק', 'קרח', 'מיץ חמוציות']

והינה רשימה של שאלות ותשובות שהיצור השנון הזה נשאל וענה כדי שתבחר לו עכשיו את הקוקטייל בצורה הכי קורעת מצחוק:

{}

שאלה: אם הייתם ריח של תיק כושר אחרי אימון של שבוע שלם, איזה טעם של קוקטייל הייתם
תשובה: טעם של ארק עם נגיעות של נעליים אימון

כל מה שנדרש ממך הוא בחירה של קוקטייל אחד בדיוק מתוך ה-20 שברשימה, כל פעם בחירה שונה מקודמתה אץ הבחירה תעביר בצורת רשימה של שלושה פריטים 
1. המספר הסידורי של הקוקטייל ברשימה שקיבלת, בלי כל כותרת, שים לב לדייק.
2. שם הקוקטייל שבחרת מתוך הרשימה הנתונה. שים לב לדייק.
3. הסבר פרוע וקורע, מדבר ישירות אל היצור הדמיוני ומלא ההומור שבחרת עבורו קוקטייל שמסביר איך עשית לו את התאמת הקוקטייל תוך שימוש מסיבי בפרטים מהתשובות שהוא או היא סיפק לך. בלי הקדמות, עד 70 מילים אבל אפשר גם פחות, מצחיק מאוד בסגנון הרצוי. יכול להיות גם בסלנג כמו "אח שלי, תראה מה בחרתי לך", או "מותק תראי מה יצא ולמה בחרתי לך את זה", או "יא מכוער... תראה מה יצא" או "כוניפה, בחרתי לך משהו",  אבל ההסבר השנון לבחירה חייב להיות בסגנון הרצוי המשוגע בלי כותרות, בסגנון הכי סלנגי ופרוע. רק הסבר קורע מצחוק מדוע בחרת לו או לה את הקוקטייל הספציפי. מזכיר שהיצורים האלו ממש אוהבים דאחקות ושיורדים עליהם ואין להם כל עקבות בכל נושא, רק רוצים שתתפרע איתם בתשובה כדי שזה יצחיק אותם מאוד.
מכיוון ששמתי לב שיש לך נטיה לבחור בקוקטייל וודקה בתיק גומי, אני מבקש ממך שלא לבחור בקוקטייל הזה אלא באחר.
"""
